# YOLO-Master 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 224 layers, 7,592,412 parameters, 7,592,412 gradients, 21.0 GFLOPs

# yolo-master-backbone with Mixture of Experts (MoE) layers
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, ES_MOE, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, ES_MOE, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, ES_MOE, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]
  - [-1, 1, ES_MOE, [1024]]

head:
  - [-1, 1, Classify, [nc]]